Ran Plan for 6 projects:

1. dir: `01_IAM` workspace: `default`
1. dir: `02_Route53/rhea-so.com/atlantis.rhea-so.com` workspace: `default`
1. dir: `.` workspace: `default`
1. dir: `02_Route53/rhea-so.com` workspace: `default`
1. dir: `97_Service/Memo` workspace: `default`
1. dir: `98_Example` workspace: `default`

### 1. dir: `01_IAM` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_access_key.load-balancer-access-key will be created
+ resource "aws_iam_access_key" "load-balancer-access-key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "loadbalancer"
    }

  # aws_iam_user.load-balancer will be created
+ resource "aws_iam_user" "load-balancer" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "loadbalancer"
      + path          = "/system/"
      + tags          = {
          + "tag-key" = "tag-value"
        }
      + tags_all      = {
          + "tag-key" = "tag-value"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.load-balancer-user-policy will be created
+ resource "aws_iam_user_policy" "load-balancer-user-policy" {
      + id     = (known after apply)
      + name   = "test"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "loadbalancer"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 01_IAM`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F01_IAM%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 01_IAM`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `02_Route53/rhea-so.com/atlantis.rhea-so.com` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_route53_record.atlantis-rhea-so will be created
+ resource "aws_route53_record" "atlantis-rhea-so" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "atlantis.rhea-so.com"
      + records         = [
          + "52.78.144.248",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.rhea-so.aws_route53_zone.rhea-so will be created
+ resource "aws_route53_zone" "rhea-so" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 02_Route53/rhea-so.com/atlantis.rhea-so.com`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F02_Route53%252Frhea-so.com%252Fatlantis.rhea-so.com%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 02_Route53/rhea-so.com/atlantis.rhea-so.com`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # aws_route53_record.memo-domain will be destroyed
  # (because aws_route53_record.memo-domain is not in configuration)
- resource "aws_route53_record" "memo-domain" {
      - fqdn    = "atlantis.rhea-so.com" -> null
      - id      = "Z02629952Z1ESWD7VTUX1_atlantis.rhea-so.com_A" -> null
      - name    = "atlantis.rhea-so.com" -> null
      - records = [
          - "52.78.144.248",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z02629952Z1ESWD7VTUX1" -> null
    }

  # aws_route53_zone.rhea-so will be destroyed
  # (because aws_route53_zone.rhea-so is not in configuration)
- resource "aws_route53_zone" "rhea-so" {
      - arn           = "arn:aws:route53:::hostedzone/Z02629952Z1ESWD7VTUX1" -> null
      - comment       = "Managed by Terraform" -> null
      - force_destroy = true -> null
      - id            = "Z02629952Z1ESWD7VTUX1" -> null
      - name          = "rhea-so.com" -> null
      - name_servers  = [
          - "ns-1390.awsdns-45.org",
          - "ns-1701.awsdns-20.co.uk",
          - "ns-428.awsdns-53.com",
          - "ns-946.awsdns-54.net",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z02629952Z1ESWD7VTUX1" -> null
    }

Plan: 0 to add, 0 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 0 to add, 0 to change, 2 to destroy.

---
### 4. dir: `02_Route53/rhea-so.com` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_route53_zone.rhea-so will be created
+ resource "aws_route53_zone" "rhea-so" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ zone_id = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 02_Route53/rhea-so.com`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F02_Route53%252Frhea-so.com%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 02_Route53/rhea-so.com`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. dir: `97_Service/Memo` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 97_Service/Memo`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F97_Service%252FMemo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 97_Service/Memo`

---
### 6. dir: `98_Example` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d 98_Example`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F98_Example%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d 98_Example`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
